{
  "topic_id": 165396,
  "topic_title": "Graded assignment 1 - Submission not shown",
  "posts": [
    {
      "topic_id": 165396,
      "post_id": 586492,
      "username": "Muthupalaniappan",
      "created_at": "2025-01-26T19:31:14.825Z",
      "content": "Hello,\nI submitted my graded assignment for TDS course. But unfortunately I did not see the question in the portal asking if I have seen all questions and attended the exam. Can someone please clarify if it shall be graded still?\n@carlton @Jivraj\nimage1340×527 17.9 KB\nimage1002×560 51.4 KB",
      "post_number": 1,
      "post_url": "https://discourse.onlinedegree.iitm.ac.in/t/graded-assignment-1-submission-not-shown/165396/1",
      "image_description": "Here's a concise description of the image, including important parameters and highlighting significant elements:\n\n**Overall:**\n\nThe image shows a web interface, likely from an online learning platform or assessment system. It displays information about the session status, user login, and recent saved activity.\n\n**Key Elements:**\n\n*   **Top Red Bar:** Indicates the session has ended, specifying the end date and time: \"Ended at Sun, 26 Jan, 2025, 11:59 pm IST\". This is important because it informs the user that the activity is no longer active.\n*   **\"Have questions? Join the discussion on Discourse\" Box:** Provides a link to a discussion forum, presumably for help or clarification related to the platform or activity.\n*   **Login Information:** Shows the currently logged-in user's email address: \"22ds1000103@ds.study.iitm.ac.in.\" This confirms the user's identity.\n*   **Logout Button:** An option to log out from the session.\n*   **\"Recent saves\" Section:** Displays a history of recent saved attempts or submissions, including the date/time and the associated score. Each saved item has a \"Reload\" option which is important for the user to attempt again.\n\n**Important Parameters & Topics:**\n\n*   **Session End Date/Time:** Crucial for users to know when the activity or assessment period has finished.\n*   **User Identification:** Confirms the correct user account is active.\n*   **Recent Activity & Scores:** Allows users to track their progress and potentially reload previous attempts.\n*   **Discussion Forum:** Promotes communication and support within the platform.\n",
      "topic_url": "https://discourse.onlinedegree.iitm.ac.in/t/graded-assignment-1-submission-not-shown/165396",
      "reply_to_post_number": null
    },
    {
      "topic_id": 165396,
      "post_id": 586525,
      "username": "carlton",
      "created_at": "2025-01-27T03:13:25.884Z",
      "content": "@Muthupalaniappan\nIt is saying you did not attempt it because you did not answer the seek portal question.\nYou are not graded on the seek portal question. It only exists to make sure you saw the GA and attempted it. You are only graded on your submission of GA1 on the actual assignment page where your last saved submission is used for grading.\nKind regards",
      "post_number": 2,
      "post_url": "https://discourse.onlinedegree.iitm.ac.in/t/graded-assignment-1-submission-not-shown/165396/2",
      "image_description": null,
      "topic_url": "https://discourse.onlinedegree.iitm.ac.in/t/graded-assignment-1-submission-not-shown/165396",
      "reply_to_post_number": null
    },
    {
      "topic_id": 165396,
      "post_id": 586571,
      "username": "21f3000599",
      "created_at": "2025-01-27T05:29:27.718Z",
      "content": "Dear Sir,\nI encountered the same issue as mentioned. Could you please confirm whether GA 1 will still be evaluated under this condition, and if we will receive our actual score based on the last saved submission on the assignment page?",
      "post_number": 3,
      "post_url": "https://discourse.onlinedegree.iitm.ac.in/t/graded-assignment-1-submission-not-shown/165396/3",
      "image_description": null,
      "topic_url": "https://discourse.onlinedegree.iitm.ac.in/t/graded-assignment-1-submission-not-shown/165396",
      "reply_to_post_number": 2
    },
    {
      "topic_id": 165396,
      "post_id": 586577,
      "username": "Venkatesh_2k01",
      "created_at": "2025-01-27T05:39:41.812Z",
      "content": "sir can you please allow us to submit it . like open the seek portal for a few mins . because we have worked hard to finished the assignment and all our hardwork will be in vain … please",
      "post_number": 4,
      "post_url": "https://discourse.onlinedegree.iitm.ac.in/t/graded-assignment-1-submission-not-shown/165396/4",
      "image_description": null,
      "topic_url": "https://discourse.onlinedegree.iitm.ac.in/t/graded-assignment-1-submission-not-shown/165396",
      "reply_to_post_number": 2
    },
    {
      "topic_id": 165396,
      "post_id": 586589,
      "username": "carlton",
      "created_at": "2025-01-27T06:12:53.024Z",
      "content": "\n\n\n carlton:\n\nYou are only graded on your submission of GA1 on the actual assignment page where your last saved submission is used for grading.\n\n\n@Venkatesh_2k01 @21f3000599\nPlease refer to above reply",
      "post_number": 5,
      "post_url": "https://discourse.onlinedegree.iitm.ac.in/t/graded-assignment-1-submission-not-shown/165396/5",
      "image_description": null,
      "topic_url": "https://discourse.onlinedegree.iitm.ac.in/t/graded-assignment-1-submission-not-shown/165396",
      "reply_to_post_number": 3
    },
    {
      "topic_id": 165396,
      "post_id": 586590,
      "username": "21f3000599",
      "created_at": "2025-01-27T05:21:53.338Z",
      "content": "Hello,\nI accessed the assignment through the provided link and attempted and saved it. But unfortunately I forgot to submit it on my course LMS. I have put in a lot of effort to complete this and I scored 9,  so I kindly request you to consider it and provide your clarification on the matter.",
      "post_number": 6,
      "post_url": "https://discourse.onlinedegree.iitm.ac.in/t/graded-assignment-1-submission-not-shown/165396/6",
      "image_description": null,
      "topic_url": "https://discourse.onlinedegree.iitm.ac.in/t/graded-assignment-1-submission-not-shown/165396",
      "reply_to_post_number": null
    },
    {
      "topic_id": 165396,
      "post_id": 586663,
      "username": "23f2005471",
      "created_at": "2025-01-27T09:52:32.240Z",
      "content": "Respected Sir,\nI made the similar mistake of not selecting a yes on the seek IITM portal\nAccording to your previous replies, does it imply that only the answers submitted through the link provided will be considered for evaluation regardless of the seek portal selection for this time?\nThanks",
      "post_number": 7,
      "post_url": "https://discourse.onlinedegree.iitm.ac.in/t/graded-assignment-1-submission-not-shown/165396/7",
      "image_description": null,
      "topic_url": "https://discourse.onlinedegree.iitm.ac.in/t/graded-assignment-1-submission-not-shown/165396",
      "reply_to_post_number": null
    },
    {
      "topic_id": 165396,
      "post_id": 586677,
      "username": "carlton",
      "created_at": "2025-01-27T10:30:47.309Z",
      "content": "@23f2005471\nCorrect! Only scores that were saved in your actual last submission on the ga page itself will be evaluated (the portal question is just to make sure you were aware of the GA and confirm that you attempted it).\nKind regards",
      "post_number": 8,
      "post_url": "https://discourse.onlinedegree.iitm.ac.in/t/graded-assignment-1-submission-not-shown/165396/8",
      "image_description": null,
      "topic_url": "https://discourse.onlinedegree.iitm.ac.in/t/graded-assignment-1-submission-not-shown/165396",
      "reply_to_post_number": 7
    },
    {
      "topic_id": 165396,
      "post_id": 586747,
      "username": "22f3002539",
      "created_at": "2025-01-27T11:52:15.849Z",
      "content": "Respected Sir/Madam,\nI have submitted the TDS GA 1 assignment but failed to submit the Yes or NO option in the checkbox\nI request you to please consider my submission as I have scored 6/10 marks in the assignment\nand if you won’t my whole efforts will be lost just because of this\nimage1463×795 64.3 KB",
      "post_number": 9,
      "post_url": "https://discourse.onlinedegree.iitm.ac.in/t/graded-assignment-1-submission-not-shown/165396/9",
      "image_description": "Here's a description of the image, focusing on precision and highlighting key aspects:\n\nThe image shows a \"Graded Assignment 1\" displayed on a digital interface, possibly a website or online learning platform.  It begins with troubleshooting tips for accessing the assignment, including disabling ad blockers, allowing cookies, enabling Javascript, using Chrome Browser, disabling browser extensions, and adjusting anti-virus software.  There's a warning in bold: \"You MUST use your Student Id (eg. 22f3xxxxxxx@ds.study.iitm.ac.in) to do the Graded Assignment, otherwise your score will not be considered for evaluation.\" This highlights the importance of using the correct student identification for assignment submission and evaluation.\n\nBelow this are a single multiple-choice question (worth 1 point): \"I have seen the Graded Assignment 1 available at *this link* and have attempted it.\" The available answers are \"Yes\" and \"No\". \"This link\" is highlighted in blue, indicating it is a clickable hyperlink leading to the assignment. The user has answered \"No,\" which is indicated as incorrect (\"No, the answer is incorrect.\") and the score is reported as 0. The accepted answer is \"Yes\".\n",
      "topic_url": "https://discourse.onlinedegree.iitm.ac.in/t/graded-assignment-1-submission-not-shown/165396",
      "reply_to_post_number": null
    },
    {
      "topic_id": 165396,
      "post_id": 586750,
      "username": "carlton",
      "created_at": "2025-01-27T12:34:17.956Z",
      "content": "\n\n\n carlton:\n\nYou are not graded on the seek portal question. It only exists to make sure you saw the GA and attempted it. You are only graded on your submission of GA1 on the actual assignment page where your last saved submission is used for grading.\n\n\n@22f3002539 Please refer to above reply.\nKind regards",
      "post_number": 10,
      "post_url": "https://discourse.onlinedegree.iitm.ac.in/t/graded-assignment-1-submission-not-shown/165396/10",
      "image_description": null,
      "topic_url": "https://discourse.onlinedegree.iitm.ac.in/t/graded-assignment-1-submission-not-shown/165396",
      "reply_to_post_number": 2
    },
    {
      "topic_id": 165396,
      "post_id": 587073,
      "username": "Thinesh",
      "created_at": "2025-01-28T07:54:54.088Z",
      "content": "Dear @s.anand sir,\nFor the TDS week 1 assignment, I have submitted it in the link (this link) that was mentioned in the graded assignment but I did not submit yes in the portal tab. Can you please help me out this one time??\nI will make sure I submit it in both places next time.\nI kindly request you to help me out this one time, as this will really impact my grade particularly as of this course.\nI got a total of 9.5 in this assignment but as you can see in the image attached below I erred up with this submission\nimage747×473 15 KB",
      "post_number": 11,
      "post_url": "https://discourse.onlinedegree.iitm.ac.in/t/graded-assignment-1-submission-not-shown/165396/11",
      "image_description": "Here's a description of the image:\n\nThe image shows a question from a graded assignment, specifically question 1, which asks \"I have seen the Graded Assignment 1 available at this link and have attempted it.\" There are two radio button options, \"Yes\" and \"No.\" Below the options, it indicates \"No, the answer is incorrect.\" in red and \"Score: 0\". The accepted answer is \"Yes,\" as indicated below.\n\n**Highlighted elements:**\n\n*   **\"this link\"**: Highlighted in blue and underlined, indicating that it is a hyperlink that can be clicked for more information.\n*   **\"No, the answer is incorrect.\"**: Highlighted in red to immediately convey that the previously selected answer was wrong. Red is commonly associated with errors.\n* **\"Accepted Answers\"**: Highlighted in green. Green is typically associated with the correct answers.",
      "topic_url": "https://discourse.onlinedegree.iitm.ac.in/t/graded-assignment-1-submission-not-shown/165396",
      "reply_to_post_number": null
    },
    {
      "topic_id": 165396,
      "post_id": 587076,
      "username": "carlton",
      "created_at": "2025-01-28T08:03:25.925Z",
      "content": "@Thinesh please refer to the above response.\nKind regards",
      "post_number": 12,
      "post_url": "https://discourse.onlinedegree.iitm.ac.in/t/graded-assignment-1-submission-not-shown/165396/12",
      "image_description": null,
      "topic_url": "https://discourse.onlinedegree.iitm.ac.in/t/graded-assignment-1-submission-not-shown/165396",
      "reply_to_post_number": 11
    },
    {
      "topic_id": 165396,
      "post_id": 586827,
      "username": "23f1002223",
      "created_at": "2025-01-27T15:06:04.056Z",
      "content": "Good evening, I have submitted my GA1 in the ex website\nimage1895×885 65.2 KBI\nhowever, I was unable to submit [press the yes] on the iitm TDS coursework site.\nI just wanted to confirm that my assignment will be graded and taken into consideration.\nThank you",
      "post_number": 13,
      "post_url": "https://discourse.onlinedegree.iitm.ac.in/t/graded-assignment-1-submission-not-shown/165396/13",
      "image_description": "Here's a description of the image, focusing on key elements and highlighted information:\n\n**Overall Description:**\n\nThe image shows a screen capture of what appears to be a quiz or assignment submission page, likely from an online learning platform. It provides instructions, tips, and information related to the assignment.\n\n**Key Parameters and Topics:**\n\n*   **End Date:** The assignment ended on Sunday, January 26, 2025, at 11:59 PM IST.\n*   **Browser Issues:** There's a note indicating the browser may struggle and suggests turning off security restrictions or using a different browser if facing loading issues.\n*   **Resource Usage:** It explicitly allows the use of any resources including the Internet, ChatGPT, friends, and libraries.\n*   **Hackability:** The quiz is acknowledged as hackable and exploiting the code is allowed.\n*   **TDS (Term):** There's a section discussing whether the user should take \"TDS\" this term, and it implies that completing the assignment quickly and scoring well might lead to success in TDS.\n*   **Discussion Forum:** A link is provided to \"Join the discussion on Discourse\" for questions.\n*   **User Login:** The user is logged in as \"23f1002223@ds.study.iitm.ac.in.\"\n*   **Recent Saves:** The screen shows recent saves with the same timestamp \"1/26/2025, 11:59:45 PM\" and a score of \"9.5\".\n\n**Highlighted Parts and Their Significance:**\n\n*   **\"Browser may struggle,\" \"Use anything,\" \"It's hackable\":** These phrases are bolded, drawing attention to the specific guidelines and unusual permissions for the assignment. They emphasize the flexibility and unconventional nature of the quiz.\n*   **\"Have questions? Join the discussion on Discourse\":** This is in a bordered box that is blue, prompting users to use the forum for help.\n*   **\"Reload\" button:** This is also highlighted as this means it is available as a quick action.\n\nIn summary, the image depicts a unique assignment setup that encourages open resource usage, allows hacking, and emphasizes performance for overall success in a course called \"TDS.\" The highlighted elements point to the most important rules and options for the user.",
      "topic_url": "https://discourse.onlinedegree.iitm.ac.in/t/graded-assignment-1-submission-not-shown/165396",
      "reply_to_post_number": null
    },
    {
      "topic_id": 165396,
      "post_id": 586882,
      "username": "22f3001365",
      "created_at": "2025-01-27T17:53:42.723Z",
      "content": "hi\neven i have faced the same issue",
      "post_number": 14,
      "post_url": "https://discourse.onlinedegree.iitm.ac.in/t/graded-assignment-1-submission-not-shown/165396/14",
      "image_description": null,
      "topic_url": "https://discourse.onlinedegree.iitm.ac.in/t/graded-assignment-1-submission-not-shown/165396",
      "reply_to_post_number": 13
    },
    {
      "topic_id": 165396,
      "post_id": 587009,
      "username": "Anshuman_Dave",
      "created_at": "2025-01-28T06:14:06.723Z",
      "content": "@Jivraj @carlton I had made my submission for GA1 on the website and also secured 9/10, image attached as shown. But in the course dashboard i missed out on the trivial step of clicking Yes. Since i am also logged in from my email on the evaluatio website and my score is saved, can iT PLEASE be considered for evaluation.\nimage856×693 86.9 KB",
      "post_number": 15,
      "post_url": "https://discourse.onlinedegree.iitm.ac.in/t/graded-assignment-1-submission-not-shown/165396/15",
      "image_description": "Here's a precise description of the image, including highlighted parts and their significance:\n\n**Overall Description:**\n\nThe image shows a screenshot related to an online graded assignment, likely from a learning management system. It displays previous submission attempts, a question from the assignment, feedback on the answer, the user's score, and the correct answer. The user is asking for a submission to be evaluated as they forgot to click \"yes\".\n\n**Breakdown of Elements:**\n\n1.  **Submission History (Top):**\n    *   There are three entries showing \"Reload\" options linked to specific dates (1/26/2025) and times, along with scores (9, 8.5, and 8 respectively).\n    *   The \"Reload\" buttons likely allow the user to revisit or resubmit those attempts.\n    *   This suggests the user has attempted the assignment multiple times.\n\n2.  **User's Plea:**\n    *   Below the submission history, there is a note by the user: \"i have attempted the assignment and also saved my score, but i forgot to just click yes on the other portal, can you please allow this submission to be evaluated?\".\n    *   This suggests the user completed the assignment but may have missed a final submission step.\n\n3.  **Important instructions:**\n\n    *   The line saying \"You MUST use your Student Id (eg. 22f3xxxxxx@ds.study.iitm.ac.in) to do the Graded Assignment, otherwise your score will not be considered for evaluation.\" highlights the importance of using the correct student ID format for evaluation.\n\n4.  **Assignment Question and Feedback:**\n    *   **Question:** \"1) I have seen the Graded Assignment 1 available at this link and have attempted it.\"\n    *   **Options:** Radio buttons for \"Yes\" and \"No\" are presented.\n    *   The \"this link\" text is highlighted, indicating it is a clickable hyperlink.\n    *   **Feedback:** \"No, the answer is incorrect.\" This is the feedback after the user submitted the wrong answer\n    *   **Score: 0** This indicated that the use received a score of 0 for this specific attempt\n    *   **Accepted Answer:** The correct answer is \"Yes\".\n\n**Key Parameters and Topics:**\n\n*   **Online Assignment:** The image is clearly related to an online assignment or assessment.\n*   **Grading:** Scores are displayed for previous attempts, and the user is concerned about the evaluation of their current attempt.\n*   **Submission Process:** The user's statement indicates a specific submission process, possibly involving multiple steps or portals.\n*   **User Error:** The primary issue is that the user believes they completed the assignment but failed to finalize the submission properly by not selecting \"Yes\" .\n*   **Feedback:** The system provides immediate feedback on the answer.\n*   **Student ID:** The student is reminded that they need to use their Student ID.\n",
      "topic_url": "https://discourse.onlinedegree.iitm.ac.in/t/graded-assignment-1-submission-not-shown/165396",
      "reply_to_post_number": null
    },
    {
      "topic_id": 165396,
      "post_id": 587078,
      "username": "carlton",
      "created_at": "2025-01-28T08:06:59.187Z",
      "content": "@Thinesh @23f1002223 @22f3001365 @Anshuman_Dave\n\n\n\n\nGraded assignment 1 - Submission not shown Tools in Data Science\n\n\n@Muthupalaniappan \nIt is saying you did not attempt it because you did not answer the seek portal question. \nYou are not graded on the seek portal question. It only exists to make sure you saw the GA and attempted it. You are only graded on your submission of GA1 on the actual assignment page where your last saved submission is used for grading. \nKind regards\n  \n\nPlease refer to this post.\nKind regards",
      "post_number": 16,
      "post_url": "https://discourse.onlinedegree.iitm.ac.in/t/graded-assignment-1-submission-not-shown/165396/16",
      "image_description": null,
      "topic_url": "https://discourse.onlinedegree.iitm.ac.in/t/graded-assignment-1-submission-not-shown/165396",
      "reply_to_post_number": 13
    },
    {
      "topic_id": 165396,
      "post_id": 587730,
      "username": "Mandy",
      "created_at": "2025-01-29T19:53:05.212Z",
      "content": "image941×849 35.1 KB",
      "post_number": 17,
      "post_url": "https://discourse.onlinedegree.iitm.ac.in/t/graded-assignment-1-submission-not-shown/165396/17",
      "image_description": "Here's a concise description of the image:\n\nThe image displays a web page interface for a test or assignment. It shows the following:\n\n*   **Header:** Indicates the test has ended on Sun, 26 Jan, 2025, at 11:59 pm IST. The current score is 0, with \"Check\" and \"Save\" buttons. The header is highlighted in red, indicating the test is closed for modifications, so one can only check the results and save the current state.\n*   **Recent Saves:**  A section showing recent saved versions of the test, including timestamps and scores. The recent saves area is highlighted in light green, indicating that the system has saved recent files and states of the test.\n*   **Questions List:**  A numbered list of 18 questions, each with a topic and the marks it is worth.\n\n    *   Questions 1-18 topics involve subjects such as: VS Code Version, Make HTTP requests with uv, Run command with npx, Use Google Sheets, Use Excel, Use DevTools, Count Wednesdays, Extract CSV from a ZIP, Use JSON, Multi-cursor edits to convert to JSON, CSS selectors, Process files with different encodings, Use GitHub, Replace across files, List files and attributes, Move and rename files, Compare files and SQL: Ticket Sales.\n\nThe topics of the questions are programming and development related concepts.",
      "topic_url": "https://discourse.onlinedegree.iitm.ac.in/t/graded-assignment-1-submission-not-shown/165396",
      "reply_to_post_number": null
    },
    {
      "topic_id": 165396,
      "post_id": 587729,
      "username": "carlton",
      "created_at": "2025-01-30T03:58:21.931Z",
      "content": "Hi Mandy,\nYour scores will be pushed to the Dashboard from your saved submissions. Ignore the seek Portal result (that was a placeholder question to make students aware that GA had been released).\nKind regards",
      "post_number": 18,
      "post_url": "https://discourse.onlinedegree.iitm.ac.in/t/graded-assignment-1-submission-not-shown/165396/18",
      "image_description": null,
      "topic_url": "https://discourse.onlinedegree.iitm.ac.in/t/graded-assignment-1-submission-not-shown/165396",
      "reply_to_post_number": null
    },
    {
      "topic_id": 165396,
      "post_id": 587858,
      "username": "23ds2000134",
      "created_at": "2025-01-30T11:29:14.181Z",
      "content": "I have done my GA1 and scored 10/10 still it’s showing 0 on my dashboard.\nGA11519×799 75.2 KB",
      "post_number": 19,
      "post_url": "https://discourse.onlinedegree.iitm.ac.in/t/graded-assignment-1-submission-not-shown/165396/19",
      "image_description": "Here is a description of the image:\n\nThe image shows a screen capture of a coding challenge or exercise, likely related to SQL.\n\n**Key elements and parameters:**\n\n*   **Due Date:**  The challenge is due on Sunday, January 26, 2025, at 11:59 PM IST.\n*   **Score:** The current score is 10/10, indicating the challenge has been completed correctly.\n*   **Code Snippet:** A SQL query is displayed: `FROM tickets WHERE LOWER(TRIM(type)) = 'gold';`\n\n    *   `tickets`:  The table being queried.\n    *   `type`:  A column in the `tickets` table, likely representing the type of ticket or item.\n    *   `LOWER(TRIM(type))`:  This part of the query applies the following transformations to the `type` column:\n\n        *   `TRIM()`: Removes leading and trailing spaces from the 'type' column value. This is used to ignore any extra spaces around the type.\n        *   `LOWER()`: Converts the trimmed value to lowercase. This is used to ensure the comparison is case-insensitive.\n    *   `'gold'`:  The value being compared against, also in lowercase.\n*   **Instructions:**  The task is to retrieve all rows from the \"tickets\" table where the \"Type\" is \"Gold\", \"GOLD\", \"gold\", or any variation with different casing or with leading/trailing spaces. It also mentions something about calculating sales as units.\n*   **Highlighted Elements:**\n    *   **Score 10/10**: Highlighted to show that the coding challenges are correct.\n    *   **Check button**: Highlighted to show that the code can be validated.\n\n*   **Status:** A \"Submitted\" message indicates the user has already submitted the solution. A warning is also present: \"If you submit again, it will overwrite your previous submission and score.\"\n\n**Topic:**  The exercise is about querying a database (presumably using SQL) and demonstrating understanding of string manipulation functions (TRIM and LOWER) to handle case-insensitive comparisons and ignore whitespace.",
      "topic_url": "https://discourse.onlinedegree.iitm.ac.in/t/graded-assignment-1-submission-not-shown/165396",
      "reply_to_post_number": 18
    },
    {
      "topic_id": 165396,
      "post_id": 587859,
      "username": "23ds2000134",
      "created_at": "2025-01-30T11:30:13.099Z",
      "content": "TDS GA11080×371 18.9 KB\nWrong GA1 score on my dashboard",
      "post_number": 20,
      "post_url": "https://discourse.onlinedegree.iitm.ac.in/t/graded-assignment-1-submission-not-shown/165396/20",
      "image_description": "Here's a concise description of the image:\n\nThe image shows a screenshot of an online learning platform, likely for IIT Madras, specifically for the course \"Jan 2025-TDS\". The focused module is \"Module 1: Development Tools\". It displays the results of \"Graded Assignment 1.\" Key information is provided, including:\n\n*   The assignment due date: January 26, 2025\n*   Submission status: \"Submitted\"\n*   Your Score: 100\n*   Peer Average: 99%\n*   Median Score: 100\n\n\"Submitted\", \"View Chart\" are highlighted because these are important attributes and buttons for students to use.",
      "topic_url": "https://discourse.onlinedegree.iitm.ac.in/t/graded-assignment-1-submission-not-shown/165396",
      "reply_to_post_number": 19
    },
    {
      "topic_id": 165396,
      "post_id": 587860,
      "username": "carlton",
      "created_at": "2025-01-30T11:31:53.516Z",
      "content": "Thats not the dashboard.\nWe have checked your submissions. Unfortunately your last submission was 0 (on the 19th of Jan). Only the last submission is considered for evaluation not the previous ones.\nKind regards",
      "post_number": 21,
      "post_url": "https://discourse.onlinedegree.iitm.ac.in/t/graded-assignment-1-submission-not-shown/165396/21",
      "image_description": null,
      "topic_url": "https://discourse.onlinedegree.iitm.ac.in/t/graded-assignment-1-submission-not-shown/165396",
      "reply_to_post_number": null
    },
    {
      "topic_id": 165396,
      "post_id": 587866,
      "username": "23ds2000134",
      "created_at": "2025-01-30T11:45:10.879Z",
      "content": "Screenshot 2025-01-30 171404432×321 16.6 KB",
      "post_number": 22,
      "post_url": "https://discourse.onlinedegree.iitm.ac.in/t/graded-assignment-1-submission-not-shown/165396/22",
      "image_description": "The image shows a course titled \"Tools in Data Science,\" marked as a \"NEW COURSE.\" The background features a dark blue color with a halftone dot pattern and lighter blue curved sections. Below the course title, there's an indication of \"Week 1 Assignment - 0.00,\" suggesting it's a score or grade for the first assignment of the course.",
      "topic_url": "https://discourse.onlinedegree.iitm.ac.in/t/graded-assignment-1-submission-not-shown/165396",
      "reply_to_post_number": null
    },
    {
      "topic_id": 165396,
      "post_id": 588259,
      "username": "Yogesh1",
      "created_at": "2025-01-31T12:49:22.938Z",
      "content": "@carlton Why is there a mismatch between the scores?\nCapture1348×216 3.75 KB\nCapture2446×240 12.6 KB",
      "post_number": 23,
      "post_url": "https://discourse.onlinedegree.iitm.ac.in/t/graded-assignment-1-submission-not-shown/165396/23",
      "image_description": "Here's a description of the image:\n\nThe image displays a light-green panel labeled \"Recent saves\". Below the title, there are three entries, each representing a saved state:\n\n*   Each entry begins with a \"Reload\" button, designed to be interactive and presumably allowing the user to revert to that save. The text \"Reload\" is within a blue outlined box that gives the feel of being a hyperlink.\n*   Following \"Reload\", each line includes the date and time when the save was created. The dates are in the format day/month/year, and the times are displayed in the format hours:minutes:seconds am/pm. For example, \"from 27/1/2025, 1:14:12 pm\" indicates the save was created on January 27, 2025, at 1:14:12 PM.\n*   Each entry also displays a \"Score\" associated with the save. The scores are numerical values, with \"Score: 8.5\" and \"Score: 7.25\" appearing in the entries.\n\nThe entries are ordered chronologically, with the most recent save (27/1/2025) at the top and the older saves (22/1/2025) listed below. The \"Reload\" buttons are highlighted because they are interactive elements, indicating where the user can click to perform an action. The score parameters show the score that was acquired in that save.",
      "topic_url": "https://discourse.onlinedegree.iitm.ac.in/t/graded-assignment-1-submission-not-shown/165396",
      "reply_to_post_number": null
    },
    {
      "topic_id": 165396,
      "post_id": 588270,
      "username": "carlton",
      "created_at": "2025-01-31T13:42:02.551Z",
      "content": "Hi Yogesh,\nThere is no discrepancy, your last submission before the deadline was on 22nd Jan 8:14 pm. You scored 7.25, exactly as mentioned in your recent saves.\nThe higher score was on the 27th of Jan after the deadline.\nKind regards",
      "post_number": 24,
      "post_url": "https://discourse.onlinedegree.iitm.ac.in/t/graded-assignment-1-submission-not-shown/165396/24",
      "image_description": null,
      "topic_url": "https://discourse.onlinedegree.iitm.ac.in/t/graded-assignment-1-submission-not-shown/165396",
      "reply_to_post_number": null
    }
  ],
  "topic_url": "https://discourse.onlinedegree.iitm.ac.in/t/graded-assignment-1-submission-not-shown/165396"
}