{
  "topic_id": 163158,
  "topic_title": "Tds jan 2025 calender accesss and video lecture access in portal",
  "posts": [
    {
      "topic_id": 163158,
      "post_id": 579381,
      "username": "RaunakThatoi",
      "created_at": "2025-01-13T16:45:09.817Z",
      "content": "dear @carlton sir i am unable to access the course calender for tds and  also not able to get the recorded videos  of tds in my portal.kindly help  me out with this",
      "post_number": 1,
      "post_url": "https://discourse.onlinedegree.iitm.ac.in/t/tds-jan-2025-calender-accesss-and-video-lecture-access-in-portal/163158/1",
      "image_description": null,
      "topic_url": "https://discourse.onlinedegree.iitm.ac.in/t/tds-jan-2025-calender-accesss-and-video-lecture-access-in-portal/163158",
      "reply_to_post_number": null
    },
    {
      "topic_id": 163158,
      "post_id": 579393,
      "username": "jahnavih",
      "created_at": "2025-01-13T17:01:32.562Z",
      "content": "Same issue with me sir.\nThis is how my dashboard looks like. It shows the same for week 2 as well.\ndashboard_tds_jahnaviHunsigida936×561 93.3 KB",
      "post_number": 2,
      "post_url": "https://discourse.onlinedegree.iitm.ac.in/t/tds-jan-2025-calender-accesss-and-video-lecture-access-in-portal/163158/2",
      "image_description": "Here's a concise description of the image:\n\nThe image displays a screenshot of an online course platform, likely for an IIT Madras course (Jan 2025-TDS). The left sidebar shows course navigation with options for \"Modules\" and \"Grades,\" with \"Grades\" currently selected. The main content area is displaying information for \"Graded Assignment 1,\" including:\n\n*   **Due Date:** Highlighted in red, the due date is January 26, 2025, at 23:59 IST. Highlighting emphasizes the importance of meeting the deadline.\n\n*   **Submission Policy:** Students can submit multiple times before the due date, with the final submission being considered.\n\n*   **Troubleshooting Tips:** A list of potential issues preventing access to the assignment is provided:\n\n    *   Ad blockers\n    *   Cookie blocking\n    *   JavaScript being disabled\n    *   Browser compatibility (recommending Chrome)\n    *   Browser extensions\n    *   Overly aggressive antivirus software\n\n*   **Student ID Requirement:** Emphasized in bold, students must use their student ID (example provided) for the assignment. This is highlighted to ensure students follow the correct procedure to receive proper evaluation.\n\n*   **Confirmation Question:** Students are asked to confirm they have seen the assignment at the provided link and have attempted it. A link to the assignment is highlighted in purple.\n\n*   **Response Options:** Radio buttons for \"Yes\" and \"No\" are provided for the confirmation question.",
      "topic_url": "https://discourse.onlinedegree.iitm.ac.in/t/tds-jan-2025-calender-accesss-and-video-lecture-access-in-portal/163158",
      "reply_to_post_number": null
    },
    {
      "topic_id": 163158,
      "post_id": 579396,
      "username": "carlton",
      "created_at": "2025-01-13T17:25:38.996Z",
      "content": "@RaunakThatoi @jahnavih\nThe course content is available at\nScreenshot 2025-01-13 at 22.47.142068×788 75.4 KB\nAt Tools in Data Science the course calendar is also available.\nScreenshot 2025-01-13 at 22.51.332044×1082 250 KB\nLikewise the GAs also are available through the links in the seek portal as well as on the course domain shared above.\nThe course introduction has very important information. Many students who faced problems in Tools for Data Science in previous terms usually never read the intro. Please be diligent to read everything carefully.\nDon’t gloss over these bits (they are expandable if you click on them) for eg…\nScreenshot 2025-01-13 at 22.59.19778×268 22.7 KB\nScreenshot 2025-01-13 at 23.01.491684×920 104 KB\nKind regards",
      "post_number": 3,
      "post_url": "https://discourse.onlinedegree.iitm.ac.in/t/tds-jan-2025-calender-accesss-and-video-lecture-access-in-portal/163158/3",
      "image_description": "Here's a precise description of the image, incorporating the highlighted parts and their likely significance:\n\n**Description:**\n\nThe image shows a webpage for an online course, likely offered by IIT Madras in January 2025 (TDS Term).  The left-hand navigation menu indicates the user is currently within the \"Modules\" section.  The course structure is outlined, with \"Course Introduction\" selected as the current module.\n\n*   **Highlighted Left Arrow (next to \"Course Introduction\" in the main content area):** This indicates that the course introduction is currently being viewed and is also clickable to navigate backward.\n*   **Highlighted \"Course Introduction\" in Navigation Menu:** This indicates the current module the user is viewing within the course structure.\n*   **Highlighted Link \"TDS 2025 Jan Term\":** This is a clickable link, likely pointing to the complete course content or materials for the \"TDS 2025 Jan Term\" course. The highlight emphasizes that this is the primary access point for the full course content.\n    **Topics covered:** Online learning, IIT Madras, course modules, course introduction, course navigation, TDS (likely referring to term), links.\n\n**Parameters:**\n\n*   Course Provider: IIT Madras\n*   Course Term: January 2025 (TDS Term)\n*   Current Module: Course Introduction\n*   Content: A link to the full course \"TDS 2025 Jan Term\", including a rating of \"5/5 (1 reviews)\".",
      "topic_url": "https://discourse.onlinedegree.iitm.ac.in/t/tds-jan-2025-calender-accesss-and-video-lecture-access-in-portal/163158",
      "reply_to_post_number": null
    },
    {
      "topic_id": 163158,
      "post_id": 584971,
      "username": "Mandy",
      "created_at": "2025-01-25T11:46:39.675Z",
      "content": "I’m confused where exactly is the TDS course?\nimage1920×1073 124 KB\nWhere are the weekly videos?\nWhere and what is the assignment?\nI’m confused.",
      "post_number": 5,
      "post_url": "https://discourse.onlinedegree.iitm.ac.in/t/tds-jan-2025-calender-accesss-and-video-lecture-access-in-portal/163158/5",
      "image_description": "Here's a precise description of the image, taking into account highlighted elements and their significance:\n\n**Overall Image Description:**\n\nThe image shows a screenshot of an online course platform, specifically a page for a \"Graded Assignment 1.\" The screen is divided into two main sections: a navigation menu on the left and the assignment content on the right.\n\n**Left Navigation Menu:**\n\n*   A list of course modules is displayed: \"Course Introduction,\" \"Module 1: Development Tools\" (with \"Graded Assignment 1\" highlighted and selected), \"Module 2: Deployment Tools,\" \"Module 3: Large Language Models,\" \"Project 1,\" and \"Learning Feedback.\" The highlighting indicates that the user is currently viewing the \"Graded Assignment 1\" within the \"Development Tools\" module.\n\n**Right Assignment Content Area:**\n\nThis section displays the details and instructions for the graded assignment. Important parameters and sections include:\n\n*   **Title:** \"Graded Assignment 1\"\n*   **Due Date:** \"Due date for this assignment: 2025-01-26, 23:59 IST\" This indicates the deadline.\n*   **Submission Policy:** \"You may submit any number of times before the due date. The final submission will be considered for grading.\"\n*   **Troubleshooting:** A list of potential causes for access issues is provided. These include:\n    *   \"Ad blockers need to be disabled/removed.\"\n    *   \"The site requires cookies for authentication. So any cookie blocking/tracker blocking extensions or software may prevent access.\"\n    *   \"Javascript is required for the site to work correctly.\"\n    *   \"Chrome Browser is the recommended software to access the contents.\"\n    *   \"Disable any browser extensions that may be interfere with the site from working correctly.\"\n    *   \"Overly aggressive anti-virus software may also cause similar access problems.\"\n\n*   **Mandatory Student ID:** The text \"You MUST use your Student Id (eg. 22f3xxxxxxx@iits.study.iitm.ac.in) to do the Graded Assignment, otherwise your score will not be considered for evaluation.\" is highlighted, emphasizing its importance. This indicates that the submission requires a specific Student ID format, and failure to comply will result in no grading.\n\n*   **Confirmation Question:**\n    *   \"I have seen the Graded Assignment 1 available at this link and have attempted it.\"\n    *   Options: \"Yes,\" \"No\"\n    *   The phrase \"this link\" is highlighted in blue, indicating that it is a clickable hyperlink to the actual assignment.\n*   **Submit Button:**  A \"Submit Answers\" button is present to finalize the assignment submission.\n\n**Highlighting and Significance:**\n\n*   **\"Graded Assignment 1\" in Navigation Menu:** Indicates the currently selected page.\n*   **Student ID Requirement:** Highlighting emphasizes the importance of providing the correct Student ID format for evaluation.\n*   **\"This link\":** The blue highlighting indicates that is it a hyperlink.\n\n**Overall Impression:**\n\nThis is a standard online assignment page, with clear instructions, submission guidelines, and a required confirmation step. The highlighting draws attention to critical elements that students must pay attention to for successful assignment completion.\n",
      "topic_url": "https://discourse.onlinedegree.iitm.ac.in/t/tds-jan-2025-calender-accesss-and-video-lecture-access-in-portal/163158",
      "reply_to_post_number": null
    },
    {
      "topic_id": 163158,
      "post_id": 584974,
      "username": "carlton",
      "created_at": "2025-01-25T13:45:37.712Z",
      "content": "Kindly refer to this post\n\n\n\n\nTds jan 2025 calender accesss and video lecture access in portal Tools in Data Science\n\n\n@RaunakThatoi @jahnavih \nThe course content is available at \n [Screenshot 2025-01-13 at 22.47.14] \nAt Tools in Data Science the course calendar is also available. \n [Screenshot 2025-01-13 at 22.51.33] \nLikewise the GAs also are available through the links in the seek portal as well as on the course domain shared above. \nThe course introduction has very important information. Many students who faced problems in Tools for Data Science in previous terms usually never read the intro. Please be dilig…\n  \n\nKind regards",
      "post_number": 6,
      "post_url": "https://discourse.onlinedegree.iitm.ac.in/t/tds-jan-2025-calender-accesss-and-video-lecture-access-in-portal/163158/6",
      "image_description": null,
      "topic_url": "https://discourse.onlinedegree.iitm.ac.in/t/tds-jan-2025-calender-accesss-and-video-lecture-access-in-portal/163158",
      "reply_to_post_number": 5
    }
  ],
  "topic_url": "https://discourse.onlinedegree.iitm.ac.in/t/tds-jan-2025-calender-accesss-and-video-lecture-access-in-portal/163158"
}