{
  "topic_id": 169352,
  "topic_title": "Solve this roe mistake pls",
  "posts": [
    {
      "topic_id": 169352,
      "post_id": 604247,
      "username": "22f3000099",
      "created_at": "2025-03-07T13:58:20.601Z",
      "content": "image2559×1599 385 KB\ncan any one tell me why still it shows me that i miss exam although i pass it with 8.",
      "post_number": 1,
      "post_url": "https://discourse.onlinedegree.iitm.ac.in/t/solve-this-roe-mistake-pls/169352/1",
      "image_description": "Here's a precise description of the image, incorporating the highlighted elements and key parameters:\n\n**Overall Description:**\n\nThe image is a screenshot of a web page for an online assessment titled \"TDS 2025 Jan ROE,\" likely a quiz or exam. The page is presented in a dark theme and contains instructions, information about bonus marks, support options, and recent save history. The assessment ended on Sun, 2 Mar, 2025, at 1:45 pm IST.\n\n**Highlighted Elements and Their Significance:**\n\n*   **Top Red Bar:** This bar shows the title of the assesment, the due date and time, the score (Score :8) and the check all and save options, The main features are the Score, The Check all and Save options, it shows that the assesment can be saved.\n*   **Check** Indicates checking the answer for a question regularly\n*   **Save** Indicates saving the progress regularly\n*   **Have questions? Join Discourse (IITM students only) / Technical issues? OPTIONAL: Join Google Meet (IITM students only):** This teal-colored section provides links to support resources.  The highlighting (teal background and bold text) emphasize its importance, directing students where to get help. The indication \"IITM students only\" restricts the resource to a specific group.\n*   **\"Recent saves\":** This dark-green box displays a log of recent saves made by the user, including the date, time, and score.  This is relevant for tracking progress and ensuring data is not lost.\n\n**Key Parameters and Topics:**\n\n*   **Assessment Title:** TDS 2025 Jan ROE\n*   **Institution:** IITM (Indian Institute of Technology Madras), referenced in student-only resources.\n*   **Due Date/Time:** Ended Sun, 2 Mar, 2025, 1:45 pm IST\n*   **Instructions:** The page includes detailed instructions for taking the assessment, covering topics like learning material, answer checking, saving progress, reloading, browser compatibility, resource usage (including ChatGPT), and that hacking the code for the quiz is allowed.\n*   **Bonus Mark:** Information about qualifying for a bonus mark by submitting a form before 5 PM IST (specifically for IITM students).\n*   **Technical Support:** Options for joining a Discourse forum (for questions) and a Google Meet (for technical issues), both exclusive to IITM students.\n*   **User Information:**  Indicates the user is logged in with their IITM email address (22I3000099@ds.study.iitm.ac.in).\n*   **Save History:** Tracks recent saves with timestamps and scores.\n\n**In summary:** The image depicts an online assessment platform specifically tailored for IITM students. The highlighted sections are designed to guide students towards resources and important actions, while the instructions provide clear rules and guidelines for the assessment.",
      "topic_url": "https://discourse.onlinedegree.iitm.ac.in/t/solve-this-roe-mistake-pls/169352",
      "reply_to_post_number": null
    },
    {
      "topic_id": 169352,
      "post_id": 604291,
      "username": "Sagan",
      "created_at": "2025-03-07T15:33:38.472Z",
      "content": "Did you submit before 1:47? If yes, then your highest score will be taken.\nIf not then, you will be marked absent.",
      "post_number": 2,
      "post_url": "https://discourse.onlinedegree.iitm.ac.in/t/solve-this-roe-mistake-pls/169352/2",
      "image_description": null,
      "topic_url": "https://discourse.onlinedegree.iitm.ac.in/t/solve-this-roe-mistake-pls/169352",
      "reply_to_post_number": null
    }
  ],
  "topic_url": "https://discourse.onlinedegree.iitm.ac.in/t/solve-this-roe-mistake-pls/169352"
}