{
  "topic_id": 165142,
  "topic_title": "GA2 deadline",
  "posts": [
    {
      "topic_id": 165142,
      "post_id": 584748,
      "username": "24f2006531",
      "created_at": "2025-01-25T07:07:19.955Z",
      "content": "I wanted to seek clarification regarding the deadline for GA2. The latest email received today mentions the deadline as 26th January, whereas an earlier email stated 2nd February, which is also reflected on the dashboard.\nCould you please confirm the correct deadline to avoid any confusion?\nimage1056×289 15.4 KB",
      "post_number": 1,
      "post_url": "https://discourse.onlinedegree.iitm.ac.in/t/ga2-deadline/165142/1",
      "image_description": "Here's a concise description of the image:\n\n**Image Description:**\n\nThe image is a screenshot of an email notification. The email is from \"donot_reply@study.iitm.ac.in\" and sent to the mailing list \"25t1_se2002-announce.\" The subject line is implied to be related to a deadline, which is highlighted within the email body: \"The deadline for the Week 1 & 2 Graded Assignment is 26/01/2025 23:59 Hrs.\"  The email is addressed to \"Dear Learner\" and signed off with \"Warm Regards, IITM BS Team.\"  The email was received at 12:23 PM, which was 7 minutes prior to the screenshot being taken.\n\n**Highlighted Elements and Why:**\n\nThe key element highlighted is the \"The deadline for the Week 1 & 2 Graded Assignment is 26/01/2025 23:59 Hrs.\". This is highlighted because it is the main message and critical piece of information that the email sender wants the recipient to notice.  Specifically, it conveys the final date and time for submitting a graded assignment (Week 1 & 2). The deadline details of the course is highlighted to bring the attention of the recipient.",
      "topic_url": "https://discourse.onlinedegree.iitm.ac.in/t/ga2-deadline/165142",
      "reply_to_post_number": null
    },
    {
      "topic_id": 165142,
      "post_id": 584796,
      "username": "Saransh_Saini",
      "created_at": "2025-01-25T09:04:53.780Z",
      "content": "Deadline for GA 2 has been shifted to 2nd Feb.\nRegards,\nTDS TA",
      "post_number": 2,
      "post_url": "https://discourse.onlinedegree.iitm.ac.in/t/ga2-deadline/165142/2",
      "image_description": null,
      "topic_url": "https://discourse.onlinedegree.iitm.ac.in/t/ga2-deadline/165142",
      "reply_to_post_number": null
    }
  ],
  "topic_url": "https://discourse.onlinedegree.iitm.ac.in/t/ga2-deadline/165142"
}